Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: རིགས་དེ་ནི་མཛའ་བ་བརྟན་པ་ཡིན། རིགས་དེ་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པའི་སྲོག་ཆགས་ཀྱི་སྲོག་ལ་ལྟ་བ་ཡིན།
en: This family should be steadfast in its friendships and safeguard the lives of all the beings throughout the animal kingdom.

source: རིགས་དེ་ནི་བྱས་པ་གཟོ་བ་དང་ལྡན་པ་ཡིན། རིགས་དེ་ནི་བརྟུལ་ཞུགས་ཤེས་པ་ཡིན།
en: They must have gratitude and know how to conduct themselves appropriately.

source: རིགས་དེ་ནི་འདུན་པས་མི་འགྲོ་བ་ཡིན། རིགས་དེ་ནི་ཞེ་སྡང་གིས་མི་འགྲོ་བ་ཡིན། རིགས་དེ་ནི་གཏི་མུག་གིས་མི་འགྲོ་བ་ཡིན། རིགས་དེ་ནི་འཇིགས་པས་མི་འགྲོ་བ་ཡིན།
en: They must not be moved by ambition, anger, ignorance, or fear.

source: རིགས་དེ་ནི་ཁ་ན་མ་ཐོ་བས་འཇིགས་པ་ཡིན།
en: They must be afraid of engaging in negative deeds.

source: རིགས་དེ་ནི་གཏི་མུག་ལ་མི་གནས་པ་ཡིན།
en: They must not dwell in ignorance.

source: རིགས་དེ་ནི་ལག་སྦབས་ཆེ་བ་ཡིན། རིགས་དེ་ནི་བྱ་བ་ལ་མོས་པ་ཡིན།
en: This family must be benevolent and industrious.

source: རིགས་དེ་ནི་གཏོང་བ་ལ་མོས་པ་ཡིན། རིགས་དེ་ནི་སྦྱིན་པ་ལ་མོས་པ་ཡིན།
en: It must be inspired to give, be generous, and remember the kindness of others.

source: རིགས་དེ་ནི་ཞོ་ཤ་ཤེས་པ་ཡིན། རིགས་དེ་ནི་རྩལ་བརྟན་པ་ཡིན། རིགས་དེ་ནི་མཐུ་རྩལ་དང་ལྡན་པ་ཡིན། རིགས་དེ་ནི་རྩལ་མཆོག་དང་ལྡན་པ་ཡིན།
en: They must be physically strong, with great power and strength, indeed supreme strength.

source: རིགས་དེ་ནི་དྲང་སྲོང་མཆོད་པ་ཡིན། རིགས་དེ་ནི་ལྷ་མཆོད་པ་ཡིན། རིགས་དེ་ནི་མཆོད་རྟེན་མཆོད་པ་ཡིན། རིགས་དེ་ནི་མཚུན་རྗེད་པ་ཡིན།
en: They must make offerings to the sages, to the gods, and to stūpas, and also pay homage to their ancestors.

source: རིགས་དེ་ནི་ཁོན་དུ་འཛིན་པ་མེད་པ་ཡིན།
en: They must not hold grudges.

source: རིགས་དེ་ནི་ཕྱོགས་བཅུར་སྒྲ་གྲགས་པ་ཡིན། རིགས་དེ་ནི་འཁོར་ཆེན་པོ་དང་ལྡན་པ་ཡིན།
en: “This family must be renowned throughout the ten directions and have a vast retinue.

source: རིགས་དེ་ནི་འཁོར་མི་ཕྱེད་པ་དང་ལྡན་པ་ཡིན།
en: It must not be divided.

source: རིགས་དེ་ནི་བླ་ན་མེད་པའི་འཁོར་དང་ལྡན་པ་ཡིན།
en: It must be peerless.

source: རིགས་དེ་ནི་རིགས་ཀྱི་ནང་ན་གཙོ་བོར་བྱ་བ་ཡིན། རིགས་དེ་ནི་རིགས་ལ་དབང་ཐོབ་པ་ཡིན།
en: This family must be the most senior and the most illustrious among all families.

source: རིགས་དེ་ནི་དབང་ཆེ་བར་གྲགས་པ་ཡིན།
en: It must be powerful, and renowned as such.

source: རིགས་དེ་ནི་ཕར་འཛིན་པ་ཡིན། རིགས་དེ་ནི་མར་འཛིན་པ་ཡིན། རིགས་དེ་ནི་དགེ་སྦྱོང་དུ་འཛིན་པ་ཡིན།
en: They must respect their fathers, mothers, mendicants, and priests.

source: རིགས་དེ་ནི་བྲམ་ཟེར་འཛིན་པ་ཡིན། རིགས་དེ་ནི་ནོར་དང་འབྲུའི་བང་མཛོད་མང་བ་ཡིན།
en: They must have great stores of treasure and grain.

source: རིགས་དེ་ནི་དབྱིག་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། ས་ལེ་སྦྲམ་དང་། དངུལ་དང་། རྫས་དང་། ཡོ་བྱད་མང་བ་ཡིན།
en: They must have a great deal of gold, and many jewels, gems, pearls, lapis lazuli, conches, crystals, corals, fine gold, silver, and many other riches and belongings.

source: རིགས་དེ་ནི་གླང་པོ་ཆེ་དང་། རྟ་དང་། རྔ་མོ་དང་། བ་ལང་དང་། ལུག་ཤིན་ཏུ་མང་བ་ཡིན།
en: They must have many elephants, horses, camels, oxen, and sheep.

source: རིགས་དེ་ནི་བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་ཤིན་ཏུ་མང་བ་ཡིན།
en: They must have many male servants, female servants, officials, and workers.

source: རིགས་དེ་ནི་ཐུབ་པར་དཀའ་བ་ཡིན།
en: This family must be difficult to defeat.

source: རིགས་དེ་ནི་དོན་ཐམས་ཅད་གྲུབ་པ་ཡིན།
en: It must accomplish all of its aims.

source: རིགས་དེ་ནི་འཁོར་ལོས་སྒྱུར་བའི་རིགས་ཀྱི་རྒྱུད་དུ་སྐྱེས་པ་ཡིན།
en: It must be a family of universal monarchs.

source: རིགས་དེ་ནི་སྔོན་གྱི་དགེ་བའི་རྩ་བའི་གྲོགས་ཀྱིས་བསྐྱེད་པ་ཡིན།
en: It must be aided, in great measure, by the root virtues accumulated in the past.

source: རིགས་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རིགས་སུ་རིགས་བཙུན་པར་སྐྱེས་པ་ཡིན།
en: It must be descended from a noble family, a family of bodhisattvas.

source: རིགས་དེ་ནི་འཇིག་རྟེན་ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ། ཚངས་པ་དང་བཅས་པ། དགེ་སྦྱོང་དང་བྲམ་ཟེའི་སྐྱེ་དགུ་དང་བཅས་པའི་ནང་ན་རིགས་ལས་སྨོས་པའི་སྐྱོན་གྱིས་ཁ་ན་མ་ཐོ་བ་ཐམས་ཅད་དང་བྲལ་བ་སྟེ།
en: Indeed this family must be irreproachable when it comes to any accusations of faults related to one’s birth, such as those found in this entire world with its gods, demons, and brahmās, mendicants and priests.

source: གྲོགས་པོ་དག་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་འབྱུང་བར་འགྱུར་བའི་རིགས་དེ་ནི་རྣམ་པ་དྲུག་ཅུ་རྩ་བཞི་པོ་དེ་དག་དང་ལྡན་པ་ཡིན་ནོ།
en: Friends, the family of a bodhisattva in his final existence must have these sixty-four qualities.

source: །གྲོགས་པོ་དག་སྲིད་པ་ཐ་མ་པའི་བྱང་ཆུབ་སེམས་དཔའ་བུད་མེད་གང་གི་མངལ་དུ་འཇུག་པར་འགྱུར་བའི་བུད་མེད་དེ་ནི་ཡོན་ཏན་གྱི་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་དང་ལྡན་པ་ཡིན་ཏེ།
en: “Friends, the woman in whose womb a bodhisattva is conceived in his final existence must have thirty-two qualities.

source: སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་ནི་ཀུན་གྱིས་མངོན་པར་ཤེས་པའི་བུད་མེད་ཀྱི་མངལ་དུ་འཇུག་གོ། ཀུན་གྱིས་མངོན་པར་རིག་པ་དང་། སྤྱོད་པ་ལ་གླགས་མི་ཐོད་པ་དང་། རིགས་ཕུན་སུམ་ཚོགས་པ་དང་། ཆོ་འབྲང་ཕུན་སུམ་ཚོགས་པ་དང་། གཟུགས་ཕུན་སུམ་ཚོགས་པ་དང་། མིང་ཕུན་སུམ་ཚོགས་པ་དང་། ཆུ་ཞེང་ཕུན་སུམ་ཚོགས་པ་དང་། སྔན་ཆད་མ་བཙས་པ་དང་། ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་དང་།
en: What are these thirty-two qualities? A bodhisattva in his final existence must be conceived in the womb of a woman known by all and steadfast in conduct. She must come from a good caste and a good family. She must have an excellent figure, an excellent name, and excellent proportions. She must not have given birth previously, and she must have excellent discipline.

source: གཏོང་བ་ཕུན་སུམ་ཚོགས་པ་དང་། བཞིན་འཛུམ་པ་དང་། འཐུན་པར་འཛིན་པ་དང་། གསལ་བ་དང་། དུལ་བ་དང་། འཇིགས་པ་མེད་པ་དང་། མང་དུ་ཐོས་པ་དང་། མཁས་པ་དང་། སྒྱུ་མེད་པ་དང་། གཡོ་མེད་པ་དང་། མི་ཁྲོ་བ་དང་། ཕྲག་དོག་མེད་པ་དང་། སེར་སྣ་མེད་པ་དང་། མི་རྒོད་པ་དང་། མི་གཡེང་བ་དང་། ཅ་ཅོ་མེད་པ་དང་། བཟོད་ཅིང་དེས་པ་དང་ལྡན་པ་དང་། ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཤས་ཆུང་བ་དང་། བུད་མེད་ཀྱི་སྐྱོན་དང་བྲལ་བ་དང་། ཁྱིམ་ཐབ་ཀྱི་བརྟུལ་ཞུགས་དང་ལྡན་པ་དང་། ཡོན་ཏན་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པའི་བུད་མེད་ཀྱི་མངལ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་འཇུག་གོ།
en: She must be generous, cheerful, and adroit. She must also be clear-minded, calm, fearless, learned, wise, honest, and without guile. She must be free from anger, jealousy, and greed. She must not be coarse, easily distracted, or prone to gossip. She must be patient and good-natured, with a good conscience and sense of modesty. She should have little attachment, anger, and ignorance. She should be free from the faults of womankind and be a devoted wife. In his final existence, a bodhisattva must be conceived in the womb of a woman with all of these excellent qualities.

source: །གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་བུད་མེད་གང་གི་མངལ་དུ་འཇུག་པའི་བུད་མེད་དེ་ནི་ཡོན་ཏན་གྱི་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་དང་ལྡན་པ་ཡིན་ནོ། །གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཟླ་བ་མར་གྱི་ངོ་ལ་མའི་མངལ་དུ་མི་འཇུག་གི །བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པ་ནི་ཟླ་བ་ཡར་གྱི་ཚེས་བཅོ་ལྔའི་ཟླ་བ་ཉ་སྟེ་རྒྱས་པ་ལ་སྐར་མ་རྒྱལ་དང་ལྡན་པའི་ཚེ། མ་གསོ་སྦྱོང་བླངས་པའི་མངལ་དུ་འཇུག་གོ། །
en: “Friends, a bodhisattva is not conceived in his mother’s womb while the moon is waning. A bodhisattva in his final existence must be conceived during a full moon. On the fifteenth day of the waxing moon, and in conjunction with the constellation Puṣya, the Bodhisattva will be conceived in the womb of a mother who is observing the poṣadha fast.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷའི་བུ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ལས་རིགས་ཡོངས་སུ་དག་པ་དང་། མ་ཡོངས་སུ་དག་པའི་རྣམ་པ་དེ་ལྟ་བུ་དེ་དག་ཐོས་ནས་འདི་སྙམ་དུ་སེམས་ཏེ། སྐྱེས་བུ་དམ་པ་འདིས་རྣམ་པ་ཇི་སྙེད་དུ་བསྟན་པ་དེ་ལྟ་བུའི་ཡོན་ཏན་དང་ལྡན་པའི་རིགས་དེ་གང་ཞིག་ལ་ཡོད་སྙམ་དུ་སེམས་སོ།
en: The bodhisattvas and gods, having heard the Bodhisattva explain the attributes of the pure family and the pure mother, thought to themselves, “Where can a family with the qualities described by this holy being be found?”

source: །དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པ་ལ་ཞུགས་པ་ན་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། ཤཱཀྱའི་གྲོང་ཁྱེར་འདི་འབྱོར་ཅིང་རྒྱས་ལ་བདེ་ཞིང་ལོ་ལེགས་པ་དང་ལྡན་ཏེ།
en: Pondering this question, they then thought, “The seat of the Śākyas is wealthy, prosperous, agreeable, and pleasant.

source: ཉམས་དགའ་ཞིང་སྐྱེ་བོ་མང་པོ་དང་མིས་གང་བ་ཡིན་ལ།
en: It has bountiful harvests and is teeming with people.

source: རྒྱལ་པོ་ཟས་གཙང་མ་ཡང་མའི་རྒྱུད་ཀྱིས་དག་པ། ཕའི་རྒྱུད་ཀྱིས་དག་པ།
en: Its king, Śuddhodana, descends from pure families on both his mother’s and father’s side.

source: ཆུང་མ་དག་པ་དང་ལྡན་པ།
en: His wife as well is pure.

source: ལས་ཀྱི་མཐའ་ལ་ཉོན་མོངས་པ་མེད་པ། དཔེ་བྱད་བཟང་བ།
en: His deeds are not swayed by the afflictions, and he bears excellent physical characteristics.

source: ཤིན་ཏུ་མཛངས་པ། བསོད་ནམས་ཀྱི་གཟི་བརྗིད་དང་ལྡན་པ། གྲགས་པ་ཆེན་པོའི་རིགས་སུ་སྐྱེས་པ། འཁོར་ལོས་སྒྱུར་བའི་རིགས་ཀྱི་རྒྱུད་དུ་སྐྱེས་པ།
en: Extremely wise and endowed with brilliant merit, the king comes from an illustrious family and is descended from a line of universal monarchs.

source: ནོར་དང་། གཏེར་དང་། རིན་པོ་ཆེ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ།
en: He has incalculable wealth and treasures and innumerable precious jewels.

source: ལས་ཡོད་པར་ལྟ་བ། སྡིག་པའི་ལྟ་བ་མེད་པ།
en: He believes in karma and does not hold negative views.

source: ཤཱཀྱའི་ཡུལ་ཀུན་ན་ཡང་རྒྱལ་པོ་དེ་གཅིག་པུར་ཟད་དེ། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། བློན་པོ་དང་། འཁོར་གྱི་མི་ཐམས་ཅད་ཀྱིས་རིམ་གྲོར་བྱ་ཞིང་མཆོད་པ། མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: He rules over all the lands of the Śākya clan and is honored and revered by all the merchants, householders, ministers, and people in his court.

source: ཧ་ཅང་ཡང་མི་རྒན་ཧ་ཅང་ཡང་མི་གཞོན་ཞིང་གཟུགས་མཛེས་ལ་ཡོན་ཏན་ཐམས་ཅད་དང་ལྡན་པ། བཟོ་ཤེས་པ། དུས་ཤེས་པ།
en: He is kind and handsome, neither too old nor too young. He has a fine body and every excellent quality.

source: བདག་ཤེས་པ། ཆོས་ཤེས་པ། སེམས་ཅན་ཤེས་པ། འཇིག་རྟེན་ཤེས་པ། མཚན་ཤེས་པ།
en: He is knowledgeable concerning crafts, astrology, the self, the Dharma, the truth, the world, and signs.

source: ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་ཀྱིས་རྗེས་སུ་སྟོན་པའོ།
en: Indeed he is a Dharma king who guides according to the Dharma.

source: །སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ནི་སེམས་ཅན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་རྣམས་ཀྱི་གནས་ཏེ།
en: “The city of Kapilavastu is the abode of sentient beings who have generated basic virtues.

source: གང་དག་དེར་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཀྱང་དེ་དང་སྐལ་བ་འདྲ་བ་དག་གོ།
en: All those who are born there are equal in fortune to the king.

source: །རྒྱལ་པོ་ཟས་གཙང་མ་དེ་ལ་ལྷ་མོ་སྒྱུ་འཕྲུལ་ཞེས་བྱ་བ་ཤཱཀྱའི་བདག་པོ་ཤིན་ཏུ་ལེགས་པར་རྟོགས་པ་ཞེས་བྱ་བའི་བུ་མོ་ཞིག་ཡོད་པའང་ཕྱུག་ཅིང་གཞོན་ཞིང་དར་ལ་བབ་པའི་གཟུགས་ཕུན་སུམ་ཚོགས་པ་སྔན་ཆད་མ་བཙས་པ།
en: The wife of King Śuddhodana is Māyādevī, the daughter of Suprabuddhā, a ruler of the Śākya clan. She is wealthy and youthful. Indeed she is in the prime of life. She has an excellent figure and has not given birth.

source: བུ་དང་བུ་མོ་མེད་པ།
en: She has no sons or daughters.

source: གཟུགས་མཛེས་པ། བུ་དོན་ལ་བྲིས་པ་ལྟར་བལྟ་ན་སྡུག་པ། ལྷའི་བུ་མོ་ལྟར་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། བུད་མེད་ཀྱི་སྐྱོན་རྣམས་དང་བྲལ་བ།
en: With a beautiful form, as pleasing to the eye as a finely drawn picture, she is bedecked with jewelry like a celestial maiden, free from the faults of womankind.

source: བདེན་པར་སྨྲ་བ། མི་དྲག་པ། མི་བརླངས་པ། མི་གཅོར་བ། ཁ་ན་མ་ཐོ་བ་མེད་པ།
en: She speaks the truth, with words that are soft, gentle, dependable, and altogether beyond reproach.

source: གྱོ་མོའི་སྒྲ་ལྟ་བུ་མེད་པ།
en: Her voice is like that of the cuckoo;

source: ཅ་ཅོ་མེད་པ། འཇམ་ཞིང་སྙན་ལ་ཡིད་དུ་འོང་བར་སྨྲ་བ།
en: she is demure and speaks only sweet and pleasant words.

source: མི་དེས་པ་དང་། ཁོང་ཁྲོ་བ་དང་། ང་རྒྱལ་དང་། དྲེགས་པ་དང་། རྒྱགས་པ་དང་། ཁྲོ་བ་མེད་པ།
en: “Māyādevī is reserved, free of anger, pride, conceit, and arrogance.

source: ཕྲག་དོག་མེད་པ།
en: She does not get indignant or jealous;

source: དུས་སུ་སྨྲ་བ། གཏོང་བ་ཕུན་སུམ་ཚོགས་པ།
en: rather what she says is timely, and she gives generously.

source: ཚུལ་ཁྲིམས་དང་ལྡན་པ། ཁྱོས་ཆོག་པར་འཛིན་པ། ཁྱིམ་ཐབ་ཀྱི་བརྟུལ་ཞུགས་ཅན། སྐྱེས་པ་གཞན་ལ་བསམ་པའི་ཡིད་ལ་བྱ་བ་དང་བྲལ་བ།
en: She is disciplined and devoted to her husband, unconcerned with other men.

source: མགོ་དང་། རྣ་བ་དང་། སྣ་གནས་སུ་ཕེབས་པ།
en: Her head, ears, and nose are perfectly symmetrical.

source: བུང་བའི་མཆོག་གི་ཁ་དོག་ལྟ་བུའི་སྐྲ་དང་ལྡན་པ། དཔྲལ་བ་ལེགས་པ། སྨིན་ཚུགས་ལེགས་པ། ཁྲོ་གཉེར་མེད་པ།
en: Her hair, as black as a bee, frames a fine forehead and a beautiful brow.

source: བཞིན་འཛུམ་པ། གསོང་པོར་སྨྲ་བ། འཇམ་ཞིང་སྙན་པའི་ཚིག་དང་ལྡན་པ། འཐུན་པར་འཛིན་པ། དྲང་བ། གྱ་གྱུ་མེད་པ། སྒྱུ་མེད་པ། གཡོ་མེད་པ། ཁྲེལ་ཡོད་ཅིང་ངོ་ཚ་ཤེས་པ།
en: Always smiling, she speaks with sincerity, her words measured and pleasing to the ear. She is quick to learn, honest and straightforward, free from guile, artifice, and deceit.

source: མི་རྒོད་པ། མི་གཡེང་བ། ཁ་ངན་མི་སྨྲ་བ། འཆལ་པའི་ཚིག་མེད་པ།
en: She is modest and decent, constant and dependable, and not prone to idle or frivolous chatter.

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཤས་ཆུང་བ།
en: She has little attachment, anger, and ignorance;

source: ངང་དེས་ཤིང་བཟོད་པ་དང་ལྡན་པ། རྐང་ལག་དང་། མིག་དང་། བློ་ཤིན་ཏུ་བསྲུངས་པ།
en: rather she is patient and of good character, carefully guarding her limbs, eyes, and mind.

source: རྐང་ལག་ཤིན་ཏུ་འཇམ་པ། ཀ་ཙ་ལིན་དའི་གོས་ལྟར་རེག་ན་བདེ་བ།
en: The movement of her limbs is gentle, and her skin is as soft as kācilindika cloth.

source: པད་མ་གཞོན་ནུའི་འདབ་མ་ལྟར་མིག་ཤིན་ཏུ་རྣམ་པར་དག་པ།
en: Her eyes are as pure as the petals of a newly blossomed lotus flower.

source: སྣ་དབྱིབས་ལེགས་ཤིང་མདོག་སྡུག་པ།
en: Her nose is well formed with a beautiful complexion.

source: ཡན་ལག་ཤིན་ཏུ་བརྟན་པ། འཇའི་དབྱིབས་ལྟར་ཤིན་ཏུ་འདུད་པ། ཡན་ལག་དང་། ཉིང་ལག་ཤིན་ཏུ་འབྱེས་པ། ཡན་ལག་ལ་སྨད་དུ་མེད་པ།
en: Her limbs are firm and gently curved like the arch of a rainbow. Every part of her body is beautiful and free of faults.

source: མཆུ་བིམ་པ་ལྟར་དམར་བ། བལྟ་ན་མཛེས་པ། མགུལ་རིམ་བཞིན་དུ་འདུག་པ། རྒྱན་དམ་པ་དང་ལྡན་པ། སྣ་མའི་མེ་ཏོག་དང་བཱར་ཤི་ཀ་ལྟར་སོ་ཤིན་ཏུ་རྣམ་པར་དག་པ།
en: She is attractive, with lips as red as the bimba fruit, a tapered neck bedecked with jewelry, and teeth as white as jasmine and sumana flowers.

source: ཕྲག་པ་ལེགས་པར་བྱིན་གྱིས་འཚམ་པ། རིམ་གྱིས་ལེགས་པར་གྲུབ་པའི་དཔུང་པ་དང་ལྡན་པ། རྐེད་པ་གཞུའི་ཆང་ཟུངས་ལྟར་ཕྲ་བ། གཞོགས་ཉམས་པ་མེད་པ། ལྟེ་བ་ཁུང་ཟབ་པ།
en: She has sloping shoulders, tapering arms, a waist curved like the arch of a bow, perfect sides, and a deep navel.

source: སྟ་ཟུར་འཇམ་ཞིང་ཡངས་ལ་ཟླུམ་ཞིང་བརྟན་པར་གྲུབ་པ།
en: Her hips are smooth, wide, round, and firm.

source: རྡོ་རྗེ་ལྟར་མཁྲེགས་ཤིང་མཚུངས་པ་མེད་པའི་ལུས་དང་ལྡན་པ།
en: Her body is as firm as a vajra.

source: གླང་པོའི་སྣ་ལྟར་མཉམ་ཞིང་ལེགས་པའི་བརླ་དང་ལྡན་པ། བྱིན་པ་རི་དགས་ཨེ་ན་ཡའི་ལྟ་བུ།
en: She has thighs that are as well proportioned as an elephant’s trunk, and calves like an antelope’s.

source: ལག་པ་དང་རྐང་པའི་མཐིལ་རྒྱ་སྐྱེགས་ཀྱི་ཁུ་བ་ལྟར་འདུག་པ།
en: The palms of her hands and the soles of her feet are like liquid lac.

source: འགྲོ་བའི་མིག་ཏུ་སྡུག་པ་མིག་གི་དབང་པོ་ཉམས་པ་མེད་པ།
en: She is attractive to others, with faultless eyes.

source: ཡིད་དུ་འོང་ཞིང་བལྟ་ན་སྡུག་པ། བུད་མེད་རིན་པོ་ཆེའི་གཟུགས་ལས་ཀྱང་ཁྱད་པར་དུ་འཕགས་པ་མཚུངས་པ་མེད་པ།
en: Alluring to the mind and pleasing to the eye, her form is superior even when compared with other beautiful women. Indeed she is without peer.

source: སྒྱུ་འཕྲུལ་སྤྲུལ་པ་ལྟ་བུའི་གཟུགས་སུ་འདུག་པ། སྒྱུ་འཕྲུལ་ཞེས་མིང་གི་བརྡར་བཏགས་པ།
en: Since her form is like a magical emanation, the word māyā, meaning ‘magically emanated,’ was included in her name.

source: སྒྱུ་རྩལ་ལ་མཁས་པ།
en: She is also skilled in all the arts.

source: དགའ་ཚལ་གྱི་ལྷའི་བུ་མོ་ལྟ་བུ་ཞིག་རྒྱལ་པོ་ཟས་གཙང་མའི་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་འདུག་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་ཚུལ་དང་འཐུན་གྱིས་གང་བྱང་ཆུབ་སེམས་དཔས་རིགས་དག་པ་བསྟན་པ་དེ་ནི་ཤཱཀྱའི་རིགས་ཉིད་ལ་སྣང་གི་གཞན་ལ་ནི་མ་ཡིན་ནོ།
en: Like a celestial maiden in the garden of Indra, Māyādevī lives in King Śuddhodana’s female quarters. She is fit to be the mother of the Bodhisattva. Thus it appears that the purity of the family described by the Bodhisattva can be seen only in the Śākya clan.”

source: དག་པའི་སེམས་ཅན་ཆོས་མཐོ་ཁང་བཟངས་ན།
en: In the Dharmoccaya Palace, the Pure Being

source: །ཆོས་བཟང་སེང་གེའི་ཁྲི་ལ་རབ་ཏུ་འདུག །བྱང་ཆུབ་སེམས་དཔའ་གྲགས་ཆེན་ལྡན་པ་དང་། །སྐལ་བ་མཉམ་པའི་ལྷ་རྣམས་དྲང་སྲོང་འཁོར།
en: Sat upon the lion throne called Sublime Dharma. Bodhisattvas of great renown and gods Equal in fortune to himself gathered around the Sage.

source: །དེ་ན་འདུག་ཅིང་དེ་ནི་འདི་སྙམ་སེམས།
en: Seated there, they entertained this thought:

source: །རིགས་གང་རྣམ་དག་རབ་ཏུ་ཤེས་དང་ལྡན།
en: “What family is known to be pure

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་དང་ཚུལ་འཐུན་གང་།
en: And fitting for the Bodhisattva to take birth in?

source: ཕ་མ་གང་ཞིག་དག་པའི་དངོས་དང་ལྡན།
en: And where are the father and mother with pure qualities?”

source: །འཛམ་བུའི་གླིང་འདི་ཀུན་ཏུ་རྣམ་བལྟས་ན།
en: Looking throughout all Jambudvīpa,

source: །རྒྱལ་རིགས་རྒྱལ་རྒྱུད་ཆེ་བ་གང་ཡིན་པ།
en: All the major royal families and royal lines

source: །ཀུན་ཀྱང་སྐྱོན་དང་བཅས་པར་རྗེས་བསམས་ནས།
en: Were found to be flawed. Considering this,

source: །ཤཱཀྱའི་རིགས་ནི་སྐྱོན་དང་བྲལ་བར་མཐོང་།
en: The Śākya clan alone was seen to be free of faults.

source: །ཟས་གཙང་རྒྱལ་པོའི་རིགས་ནང་རིགས་དང་ལྡན།
en: “King Śuddhodana belongs to a royal family.

source: །མི་དབང་རྒྱུད་ནི་རྣམ་དག་ཆོ་རིགས་ཅན།
en: He descends from a pure line of monarchs,

source: །འབྱོར་ཅིང་རྒྱས་ལ་འཁྲུག་པ་མེད་པ་སྟེ།
en: Wealthy, prosperous, and free from conflicts.

source: །སྐྱེ་བོ་དམ་པ་ཆོས་ལྡན་རིམ་གྲོ་ཅན།
en: A holy being, he is righteous and has gained respect.

source: །སེར་སྐྱར་བརྗོད་པའི་གྲོང་ཁྱེར་སེམས་ཅན་གཞན།
en: “All the other beings in the city of Kapilavastu

source: །ཀུན་ཀྱང་བསམ་པ་རབ་དག་ཆོས་དང་ལྡན།
en: Are righteous and pure in mind.

source: །སྐྱེད་མོས་ཀུན་དགའ་གཞལ་མེད་ཁང་གིས་བརྒྱན།
en: The city is filled with gardens, groves, and palaces;

source: །སྐྱེ་བའི་སར་ནི་སེར་སྐྱར་བརྗོད་པར་མཛེས།
en: The beautiful city of Kapilavastu is the most suitable birthplace.

source: །ཀུན་ཀྱང་ཚན་ཆེན་སྟོབས་དང་ལྡན་པ་སྟེ།
en: “All its inhabitants are mighty and powerful,

source: །གླང་པོ་གཉིས་སམ་གསུམ་གྱི་སྟོབས་ཀྱང་བདོག །འཕོང་རྩལ་བསླབ་པའི་ཕ་རོལ་མཐར་ཕྱིན་ཀྱང་།
en: With the strength of two or even three elephants. They have perfected their training in archery and weapons

source: །སྲོག་གི་དོན་དུ་གཞན་ལ་གནོད་མི་བྱེད།
en: And do not harm others, even to protect their own lives.

source: །ཟས་གཙང་རྒྱལ་པོའི་བུད་མེད་དབེན་པ་སྟེ།
en: “King Śuddhodana’s wife is supreme

source: །བུད་མེད་དམ་པ་སྟོང་གི་མཆོག་ཏུ་ཕྱིན།
en: Among one thousand other sublime women.

source: །ཡིད་དུ་འོང་བ་སྒྱུ་འཕྲུལ་སྤྲུལ་པའི་གཟུགས།
en: Enchanting in appearance, like a magical emanation,

source: །དེ་ཡི་མིང་ཡང་ལྷ་མོ་སྒྱུ་འཕྲུལ་ཏེ།
en: She is aptly named Māyādevī, ‘Magically Emanated Goddess.’

source: །མཛེས་པའི་གཟུགས་འཆང་ལྷ་ཡི་བུ་མོ་བཞིན།
en: “Her body is as beautiful as a celestial maiden,

source: །འབྱེས་པའི་ལུས་ལྡན་ཡན་ལག་དྲི་མེད་སྡུག །ལྷ་དང་མི་རྣམས་གང་ཡང་རུང་བ་དག །སྒྱུ་འཕྲུལ་མཐོང་ན་གང་ངོམས་དེ་མེད་ཀྱང་།
en: With a shapely silhouette and perfectly formed limbs. Any being, whether a god or a human, Could never see enough of Māyā.

source: །འདོད་ཆགས་ཞེན་མེད་སྡང་བས་ཞེ་སྡང་མེད།
en: “She harbors no attachment or hatred;

source: །དེ་ནི་འཇམ་སྙན་དྲང་བའི་ངག་དང་ལྡན།
en: She is gentle and tender, and her speech honest and mellifluous.

source: །མི་བརླང་མི་རྩུབ་ཤིན་ཏུ་དེས་པ་སྟེ།
en: Neither harsh nor abrasive, she is extremely tranquil,

source: །དེ་ནི་བཞིན་འཛུམ་ཁྲོ་གཉེར་རབ་ཏུ་སྤངས།
en: Never frowning and always with a smile on her face.

source: །ངོ་ཚ་ཁྲེལ་ཡོད་ཆོས་སྤྱོད་ལྡན་པ་སྟེ།
en: “With a good conscience and a sense of modesty, she observes the Dharma.

source: །ང་རྒྱལ་མེད་ཅིང་མ་ཁེངས་རྒོད་པ་མེད།
en: She is free of pride and conceit, and not prone to overexuberance,

source: །ཕྲག་དོག་མེད་ཅིང་སྒྱུ་དང་གཡོ་མེད་དེ།
en: Just as she has no envy and is free of guile and artifice.

source: །གཏོང་ལ་དགའ་ཞིང་རྟག་ཏུ་བྱམས་སེམས་ལྡན།
en: She delights in giving and is always loving in her thoughts.

source: །ལས་ཡོད་བལྟ་ཞིང་ལོག་པའི་སྦྱོར་བ་སྤངས།
en: “Believing in karma and abandoning misguided deeds,

source: །བདེན་ལ་གནས་ཤིང་ལུས་དང་ཡིད་རབ་བསྡམས།
en: She adheres to what is true, controlled in body and mind.

source: །ས་ལ་གང་ཡོད་བུད་མེད་སྐྱོན་མང་ཚོགས། །དེ་དག་ཐམས་ཅད་དེ་ལ་ཡོད་མི་ཡིན།
en: She is free from the multitude of faults That are commonly found in women the whole world over.

source: །མི་ཡི་འཇིག་རྟེན་དྲི་ཟའི་འཇིག་རྟེན་ནམ།
en: “Indeed Māyādevī is without rival,

source: །ལྷ་ཡི་འཇིག་རྟེན་དག་ན་བུད་མེད་གཞན།
en: For no other woman in the realm of humans can match her,

source: །ལྷ་མོ་སྒྱུ་འཕྲུལ་མཚུངས་མེད་ག་ལ་ལྷག །དྲང་སྲོང་ཆེན་པོའི་མར་ནི་དེ་འོས་ཏེ།
en: Nor so in the realm of gandharvas, or even in the heavenly realms. She is worthy of being the mother of the Great Sage.

source: །ཚེ་རབས་ལྔ་བརྒྱ་ཁོ་ནར་ཚང་བར་ཡང་།
en: “For five hundred lifetimes, she alone

source: །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་མར་གྱུར་ཏོ།
en: Has been the mother of the Bodhisattva,

source: །དེ་དང་དེར་ནི་ཡབ་ཀྱང་ཟས་གཙང་སྟེ།
en: Just as King Śuddhodana has been his father.

source: །དེ་ཕྱིར་ཡོན་ཏན་ལྡན་པ་མ་ཡི་འོས།
en: She thus has all the qualities of a worthy mother.

source: །དཀའ་ཐུབ་ཅན་ལྟར་དེ་ནི་བརྟུལ་ཞུགས་གནས།
en: “As disciplined as an ascetic, she follows a strict code of conduct,

source: །བརྟུལ་ཞུགས་རྗེས་སྤྱོད་རྟག་པར་ཆོས་ཀྱང་སྤྱོད།
en: And while following her own conduct, she shares in her husband’s duties.

source: །རྒྱལ་པོས་གནང་སྟེ་མཆོག་སྦྱིན་ཐོབ་པས་ན།
en: She has fulfilled her vow, given to her by the king,

source: །འདོད་པ་མ་སྤྱད་ཟླ་བ་སུམ་ཅུ་གཉིས།
en: For she has abstained from sexual activity for thirty-two months.

source: །གང་གི་ཕྱོགས་ན་དེ་འདུག་འགྲེང་བ་འམ།
en: “Wherever she may be, whether sitting or standing,

source: །ཉལ་ཞིང་འགྲོ་བར་གྱུར་པའི་གནས་དག་ཀྱང་།
en: Lying down or in motion, those places

source: །དེ་ཡི་ལས་དགེ་གཞོལ་བའི་འོད་ཟེར་གྱིས། །ཤིན་ཏུ་སྣང་བར་འོད་ཀྱིས་གསལ་བར་གྱུར།
en: Become filled with the brilliant light Given off by her dedication to virtuous deeds.

source: །ལྷ་དང་ལྷ་མིན་མི་རྣམས་གང་ཡང་རུང་།
en: “No being, whether god, demigod, or human,

source: །འདོད་ཆགས་སེམས་ཀྱིས་བལྟ་བར་ནུས་པ་མེད།
en: Is able to look upon her with a lustful mind. They all look upon her as a mother or a daughter,

source: །སྤྱོད་ལམ་རྣམས་སུ་འཕགས་པའི་ཡོན་ཏན་ལྡན། །དེ་ལ་ཀུན་ཀྱང་མ་དང་བུ་མོར་ལྟ།
en: For she follows the right conduct and is endowed with noble qualities.

source: །སྒྱུ་འཕྲུལ་ལྷ་མོའི་དགེ་བའི་ལས་ཀྱི་རྒྱུས།
en: “Due to the virtuous deeds of Māyādevī,

source: །རྒྱལ་པོའི་སྲིད་ནི་རབ་ཡངས་རྣམ་པར་འཕེལ།
en: The king’s vast empire increases in prosperity.

source: །ཁམས་ཀྱི་རྒྱལ་པོའང་འཇུག་པར་མི་བྱེད་ཅིང་།
en: Unmatched by the neighboring kings,

source: །རྒྱལ་པོའི་གྲགས་དང་བརྗོད་པ་རྣམ་པར་འཕེལ།
en: The ruler’s renown and fame also continue to increase.

source: །དེ་ལྟར་སྒྱུ་འཕྲུལ་སྣོད་དུ་འཐུན་གྱུར་ཅིང་།
en: “In this way Māyā is a suitable vessel;

source: །དེ་ལྟར་སེམས་ཅན་དམ་པ་མཆོག་མཛེས་པས།
en: In this way the Holy Being is supremely beautiful.

source: །དེ་གཉིས་ཡོན་ཏན་མཆོག་དང་ལྡན་པས་ན།
en: Thus, since these two are endowed with supreme qualities,

source: །འདི་ནི་བུར་འགྱུར་དེ་ནི་མ་ཡི་འོས།
en: One will be the son, and one is worthy to be the mother.

source: །ལྷ་མོ་ཡོན་ཏན་མཆོག་དང་ལྡན་པ་སྟེ།
en: “Other than Devī, who is endowed with the most supreme of qualities

source: །གླང་པོའི་ཁྲི་ཡི་སྟོབས་བདོག་མ་གཏོགས་པར། །
en: And has the strength of ten thousand elephants,

source: འཛམ་བུའི་རྒྱལ་མཚན་འདི་ན་མི་མཆོག་དེ། །འཛིན་པར་ནུས་པའི་བུད་མེད་གང་ཡང་མེད།
en: No woman would be able to carry The supreme man of Jambudvīpa.”

source: །དེ་སྐད་ཆེ་བའི་ལྷ་ཡི་བུ་རྣམས་དང་། །བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་རྒྱ་ཆེན་དག །ཤཱཀྱའི་རིགས་རྣམས་དགའ་བར་མཛད་པ་ཡི། །ཡུམ་དུ་ལེགས་ལྡན་སྒྱུ་འཕྲུལ་འགྱུར་ཞེས་ཟེར།
en: With these words of praise, the gods And bodhisattvas, with their vast knowledge, Proclaimed the sublime Māyā to be the mother, Saying, “She is fit to give birth to the joy of the Śākya family.”

source: །རིགས་ཡོངས་སུ་དག་པའི་ལེའུ་སྟེ་གསུམ་པའོ།། །།
en: This concludes the third chapter, on the purity of the family.
